Repository: hiro5791/HexEditor
Catalog: src/HexEditor.App/Strings/*/Resources.resw
Source language: en
Languages: ar, cs, de, el, es, fa, fr, hu, id, it, ja, ja_jp, ko, pl, pt, ro, ru, th, tr, uk, vi, zh_hans, zh_hant

# DataOp_Kind_Modulo
source: Modulo (remainder)
ar: باقي القسمة (modulo)
cs: Modulo (zbytek)
de: Modulo (Rest)
el: Υπόλοιπο (modulo)
es: Módulo (resto)
fa: باقی‌مانده (modulo)
fr: Modulo (reste)
hu: Modulo (maradék)
id: Modulo (sisa)
it: Modulo (resto)
ja: 剰余
ko: 모듈로(나머지)
pl: Modulo (reszta)
pt: Módulo (resto)
ro: Modulo (rest)
th: มอดุโล (เศษ)
tr: Mod (kalan)
uk: Остача від ділення
vi: Chia lấy dư (modulo)
zh_hans: 取模（余数）
zh_hant: 模數（餘數）

# Cmd_data_op_modulo
source: Modulo (remainder)
ar: باقي القسمة (modulo)
cs: Modulo (zbytek)
de: Modulo (Rest)
el: Υπόλοιπο (modulo)
es: Módulo (resto)
fa: باقی‌مانده (modulo)
fr: Modulo (reste)
hu: Modulo (maradék)
id: Modulo (sisa)
it: Modulo (resto)
ja: 剰余
ko: 모듈로(나머지)
pl: Modulo (reszta)
pt: Módulo (resto)
ro: Modulo (rest)
th: มอดุโล (เศษ)
tr: Mod (kalan)
uk: Остача від ділення
vi: Chia lấy dư (modulo)
zh_hans: 取模（余数）
zh_hant: 模數（餘數）

# CmdAlias_data_op_modulo
source: modulo (remainder)
ar: modulo (remainder) باقي القسمة
cs: modulo zbytek po dělení deleni modulo (remainder)
de: modulo rest modulo (remainder)
el: υπόλοιπο modulo (remainder)
es: módulo resto modulo (remainder)
fa: باقی‌مانده, modulo (remainder)
fr: modulo reste modulo (remainder)
hu: modulo maradék maradek modulo (remainder)
id: modulo sisa bagi modulo (remainder)
it: modulo resto modulo (remainder)
ja: じょうよ あまり
ko: 모듈로 나머지 mod modulo (remainder)
pl: modulo reszta z dzielenia modulo (remainder)
pt: módulo resto modulo (remainder)
ro: modulo rest modulo (remainder)
th: มอดุโล เศษ modulo (remainder)
tr: mod kalan modulo (remainder)
uk: остача модуль modulo (remainder)
vi: chia lấy dư số dư modulo (remainder)
zh_hans: 取模 余数 求余 modulo (remainder)
zh_hant: 模數 餘數 取餘 modulo (remainder)

# DataOp_Kind_Negate
source: Negate
ar: عكس الإشارة
cs: Negace
de: Negieren
el: Αλλαγή προσήμου
es: Negar
fa: قرینه کردن علامت
fr: Opposé
hu: Ellentett
id: Negasi
it: Nega
ja: 符号反転
ko: 부호 반전
pl: Zaneguj
pt: Negar
ro: Negare
th: กลับเครื่องหมาย
tr: İşaret değiştir
uk: Зміна знака
vi: Đổi dấu
zh_hans: 取负
zh_hant: 正負號反轉

# Cmd_data_op_negate
source: Negate
ar: عكس الإشارة
cs: Negace
de: Negieren
el: Αλλαγή προσήμου
es: Negar
fa: قرینه کردن علامت
fr: Opposé
hu: Ellentett
id: Negasi
it: Nega
ja: 符号反転
ko: 부호 반전
pl: Zaneguj
pt: Negar
ro: Negare
th: กลับเครื่องหมาย
tr: İşaret değiştir
uk: Зміна знака
vi: Đổi dấu
zh_hans: 取负
zh_hant: 正負號反轉

# CmdAlias_data_op_negate
source: negate
ar: negate عكس الإشارة سالب
cs: negace obrátit obratit znaménko znamenko negate
de: negieren vorzeichen negate
el: αλλαγή προσήμου άρνηση negate
es: negar signo negate
fa: قرینه منفی, negate
fr: opposé signe négatif negate
hu: ellentett előjelváltás elojelvaltas negálás negalas negate
id: negasi balik tanda negate
it: nega inverti segno negate
ja: ふごうはんてん
ko: 부호 반전 음수 negate
pl: zaneguj zmień znak negate
pt: negar inverter sinal negate
ro: negare semn invers negate
th: กลับเครื่องหมาย ติดลบ negate
tr: işaret değiştir eksi negate
uk: зміна знака мінус negate
vi: đổi dấu số âm negate
zh_hans: 取负 符号反转 相反数 negate
zh_hant: 正負號反轉 取負 negate

# DataOp_Kind_Abs
source: Absolute value
ar: القيمة المطلقة
cs: Absolutní hodnota
de: Absolutwert
el: Απόλυτη τιμή
es: Valor absoluto
fa: قدر مطلق
fr: Valeur absolue
hu: Abszolút érték
id: Nilai absolut
it: Valore assoluto
ja: 絶対値
ko: 절대값
pl: Wartość bezwzględna
pt: Valor absoluto
ro: Valoare absolută
th: ค่าสัมบูรณ์
tr: Mutlak değer
uk: Абсолютне значення
vi: Giá trị tuyệt đối
zh_hans: 绝对值
zh_hant: 絕對值

# Cmd_data_op_abs
source: Absolute value
ar: القيمة المطلقة
cs: Absolutní hodnota
de: Absolutwert
el: Απόλυτη τιμή
es: Valor absoluto
fa: قدر مطلق
fr: Valeur absolue
hu: Abszolút érték
id: Nilai absolut
it: Valore assoluto
ja: 絶対値
ko: 절대값
pl: Wartość bezwzględna
pt: Valor absoluto
ro: Valoare absolută
th: ค่าสัมบูรณ์
tr: Mutlak değer
uk: Абсолютне значення
vi: Giá trị tuyệt đối
zh_hans: 绝对值
zh_hant: 絕對值

# CmdAlias_data_op_abs
source: absolute value
ar: absolute value القيمة المطلقة
cs: absolutní absolutni hodnota absolute value
de: absolutwert betrag absolute value
el: απόλυτη τιμή absolute value
es: valor absoluto absolute value
fa: قدر مطلق, absolute value
fr: valeur absolue absolute value
hu: abszolút abszolut érték ertek absolute value
id: nilai mutlak absolut absolute value
it: valore assoluto absolute value
ja: ぜったいち
ko: 절대값 abs absolute value
pl: wartość bezwzględna moduł absolute value
pt: valor absoluto absolute value
ro: valoare absolută absoluta modul absolute value
th: ค่าสัมบูรณ์ absolute value
tr: mutlak değer absolute value
uk: абсолютне значення модуль absolute value
vi: giá trị tuyệt đối absolute value
zh_hans: 绝对值 absolute value
zh_hant: 絕對值 absolute value

# CmdAlias_data_op_and
source: and
ar: and و منطقي
cs: logický logicky součin soucin a and
de: und and
el: λογικό και and
es: y and
fa: و منطقی, and
fr: et and
hu: és es logikai and
id: dan logika and
it: e logico and
ja: あんど ろんりせき
ko: 논리곱 비트 and
pl: iloczyn logiczny and
pt: e lógico and
ro: și si logic and
th: และ ตรรกะ and
tr: ve and
uk: і and
vi: và logic and
zh_hans: 与 逻辑与 按位与 and
zh_hant: 邏輯與 位元與 and

# CmdAlias_data_op_or
source: or
ar: or أو منطقي
cs: logický logicky součet soucet nebo or
de: oder or
el: λογικό ή or
es: o or
fa: یا منطقی, or
fr: ou or
hu: vagy logikai or
id: atau logika or
it: o logico or
ja: おあ ろんりわ
ko: 논리합 비트 or
pl: suma logiczna or
pt: ou lógico or
ro: sau logic or
th: หรือ ตรรกะ or
tr: veya or
uk: або or
vi: hoặc logic or
zh_hans: 或 逻辑或 按位或 or
zh_hant: 邏輯或 位元或 or

# CmdAlias_data_op_xor
source: xor
ar: xor أو حصري
cs: výhradní vyhradni nebo exkluzivní exkluzivni xor
de: exklusives oder xor
el: αποκλειστικό ή xor
es: o exclusivo xor
fa: یای انحصاری, xor
fr: ou exclusif xor
hu: kizáró kizaro vagy xor
id: atau eksklusif logika xor
it: o esclusivo xor
ja: えっくすおあ はいたてきろんりわ
ko: 배타적 논리합 비트 xor
pl: alternatywa wykluczająca xor
pt: ou exclusivo xor
ro: sau exclusiv xor
th: เอกซ์ออร์ ตรรกะ xor
tr: özel veya xor
uk: виключне або xor
vi: hoặc loại trừ logic xor
zh_hans: 异或 按位异或 xor
zh_hant: 互斥或 xor

# CmdAlias_data_op_not
source: not
ar: not نفي منطقي
cs: negace inverze invertovat ne not
de: nicht invertieren not
el: λογικό όχι αντιστροφή not
es: no invertir not
fa: نقیض منطقی, not
fr: non inverser not
hu: nem negálás negalas invertálás invertalas not
id: negasi balik bit not
it: negazione inverti bit not
ja: のっと はんてん
ko: 논리 부정 반전 비트 not
pl: negacja odwróć bity not
pt: negação inverter bits not
ro: negație negatie inversare not
th: นิเสธ กลับบิต not
tr: değil not
uk: не not
vi: phủ định đảo bit not
zh_hans: 非 取反 按位取反 not
zh_hant: 邏輯非 反轉 not

# DataOp_Kind_ShiftLeft
source: Shift left
ar: إزاحة لليسار
cs: Posun doleva
de: Nach links schieben
el: Ολίσθηση αριστερά
es: Desplazar a la izquierda
fa: شیفت به چپ
fr: Décalage à gauche
hu: Biteltolás balra
id: Geser kiri
it: Scorrimento a sinistra
ja: 左シフト
ko: 왼쪽 시프트
pl: Przesuń w lewo
pt: Deslocar para a esquerda
ro: Deplasare la stânga
th: เลื่อนซ้าย
tr: Sola kaydır
uk: Зсув ліворуч
vi: Dịch trái
zh_hans: 左移
zh_hant: 左移

# Cmd_data_op_shiftLeft
source: Shift left
ar: إزاحة لليسار
cs: Posun doleva
de: Nach links schieben
el: Ολίσθηση αριστερά
es: Desplazar a la izquierda
fa: شیفت به چپ
fr: Décalage à gauche
hu: Biteltolás balra
id: Geser kiri
it: Scorrimento a sinistra
ja: 左シフト
ko: 왼쪽 시프트
pl: Przesuń w lewo
pt: Deslocar para a esquerda
ro: Deplasare la stânga
th: เลื่อนซ้าย
tr: Sola kaydır
uk: Зсув ліворуч
vi: Dịch trái
zh_hans: 左移
zh_hant: 左移

# CmdAlias_data_op_shiftLeft
source: shift left
ar: shift left إزاحة لليسار
cs: bitový bitovy posun doleva shift left
de: links schieben shift left
el: ολίσθηση αριστερά shift left
es: desplazar izquierda shift left
fa: شیفت به چپ, shift left
fr: décalage gauche shift left
hu: biteltolás biteltolas balra shift left
id: geser bit kiri shift left
it: scorrimento sinistra shift left
ja: ひだりしふと
ko: 왼쪽 시프트 좌 shift left
pl: przesunięcie w lewo shift left
pt: deslocar esquerda shift left
ro: deplasare stânga stanga shift left
th: เลื่อนบิต ซ้าย shift left
tr: sola kaydır shift left
uk: зсув ліворуч shift left
vi: dịch bit trái shift left
zh_hans: 左移 移位 shift left
zh_hant: 左移 位移 shift left

# DataOp_Kind_ShiftRightLogical
source: Shift right (logical)
ar: إزاحة لليمين (منطقية)
cs: Posun doprava (logický)
de: Nach rechts schieben (logisch)
el: Ολίσθηση δεξιά (λογική)
es: Desplazar a la derecha (lógico)
fa: شیفت به راست (منطقی)
fr: Décalage à droite (logique)
hu: Biteltolás jobbra (logikai)
id: Geser kanan (logis)
it: Scorrimento a destra (logico)
ja: 右シフト (論理)
ko: 오른쪽 시프트(논리)
pl: Przesuń w prawo (logicznie)
pt: Deslocar para a direita (lógico)
ro: Deplasare la dreapta (logică)
th: เลื่อนขวา (ตรรกะ)
tr: Sağa kaydır (mantıksal)
uk: Зсув праворуч (логічний)
vi: Dịch phải (logic)
zh_hans: 右移（逻辑）
zh_hant: 右移（邏輯）

# Cmd_data_op_shiftRightLogical
source: Shift right (logical)
ar: إزاحة لليمين (منطقية)
cs: Posun doprava (logický)
de: Nach rechts schieben (logisch)
el: Ολίσθηση δεξιά (λογική)
es: Desplazar a la derecha (lógico)
fa: شیفت به راست (منطقی)
fr: Décalage à droite (logique)
hu: Biteltolás jobbra (logikai)
id: Geser kanan (logis)
it: Scorrimento a destra (logico)
ja: 右シフト (論理)
ko: 오른쪽 시프트(논리)
pl: Przesuń w prawo (logicznie)
pt: Deslocar para a direita (lógico)
ro: Deplasare la dreapta (logică)
th: เลื่อนขวา (ตรรกะ)
tr: Sağa kaydır (mantıksal)
uk: Зсув праворуч (логічний)
vi: Dịch phải (logic)
zh_hans: 右移（逻辑）
zh_hant: 右移（邏輯）

# CmdAlias_data_op_shiftRightLogical
source: shift right (logical)
ar: shift right (logical) إزاحة لليمين منطقية
cs: bitový bitovy posun doprava logický logicky shift right (logical)
de: rechts schieben logisch shift right (logical)
el: ολίσθηση δεξιά λογική shift right (logical)
es: desplazar derecha lógico shift right (logical)
fa: شیفت به راست منطقی, shift right (logical)
fr: décalage droite logique shift right (logical)
hu: biteltolás biteltolas jobbra logikai shift right (logical)
id: geser bit kanan logis shift right (logical)
it: scorrimento destra logico shift right (logical)
ja: みぎしふと ろんり
ko: 오른쪽 시프트 논리 우 shift right (logical)
pl: przesunięcie w prawo logiczne shift right (logical)
pt: deslocar direita lógico shift right (logical)
ro: deplasare dreapta logică logica shift right (logical)
th: เลื่อนบิต ขวา ตรรกะ shift right (logical)
tr: sağa kaydır mantıksal shift right (logical)
uk: зсув праворуч логічний shift right (logical)
vi: dịch bit phải logic shift right (logical)
zh_hans: 右移 逻辑 移位 shift right (logical)
zh_hant: 右移 邏輯 shift right (logical)

# DataOp_Kind_ShiftRightArithmetic
source: Shift right (arithmetic)
ar: إزاحة لليمين (حسابية)
cs: Posun doprava (aritmetický)
de: Nach rechts schieben (arithmetisch)
el: Ολίσθηση δεξιά (αριθμητική)
es: Desplazar a la derecha (aritmético)
fa: شیفت به راست (حسابی)
fr: Décalage à droite (arithmétique)
hu: Biteltolás jobbra (aritmetikai)
id: Geser kanan (aritmetika)
it: Scorrimento a destra (aritmetico)
ja: 右シフト (算術)
ko: 오른쪽 시프트(산술)
pl: Przesuń w prawo (arytmetycznie)
pt: Deslocar para a direita (aritmético)
ro: Deplasare la dreapta (aritmetică)
th: เลื่อนขวา (เลขคณิต)
tr: Sağa kaydır (aritmetik)
uk: Зсув праворуч (арифметичний)
vi: Dịch phải (số học)
zh_hans: 右移（算术）
zh_hant: 右移（算術）

# Cmd_data_op_shiftRightArithmetic
source: Shift right (arithmetic)
ar: إزاحة لليمين (حسابية)
cs: Posun doprava (aritmetický)
de: Nach rechts schieben (arithmetisch)
el: Ολίσθηση δεξιά (αριθμητική)
es: Desplazar a la derecha (aritmético)
fa: شیفت به راست (حسابی)
fr: Décalage à droite (arithmétique)
hu: Biteltolás jobbra (aritmetikai)
id: Geser kanan (aritmetika)
it: Scorrimento a destra (aritmetico)
ja: 右シフト (算術)
ko: 오른쪽 시프트(산술)
pl: Przesuń w prawo (arytmetycznie)
pt: Deslocar para a direita (aritmético)
ro: Deplasare la dreapta (aritmetică)
th: เลื่อนขวา (เลขคณิต)
tr: Sağa kaydır (aritmetik)
uk: Зсув праворуч (арифметичний)
vi: Dịch phải (số học)
zh_hans: 右移（算术）
zh_hant: 右移（算術）

# CmdAlias_data_op_shiftRightArithmetic
source: shift right (arithmetic)
ar: shift right (arithmetic) إزاحة لليمين حسابية
cs: bitový bitovy posun doprava aritmetický aritmeticky shift right (arithmetic)
de: rechts schieben arithmetisch shift right (arithmetic)
el: ολίσθηση δεξιά αριθμητική shift right (arithmetic)
es: desplazar derecha aritmético shift right (arithmetic)
fa: شیفت به راست حسابی, shift right (arithmetic)
fr: décalage droite arithmétique shift right (arithmetic)
hu: biteltolás biteltolas jobbra aritmetikai shift right (arithmetic)
id: geser bit kanan aritmetika shift right (arithmetic)
it: scorrimento destra aritmetico shift right (arithmetic)
ja: みぎしふと さんじゅつ
ko: 오른쪽 시프트 산술 우 shift right (arithmetic)
pl: przesunięcie w prawo arytmetyczne shift right (arithmetic)
pt: deslocar direita aritmético shift right (arithmetic)
ro: deplasare dreapta aritmetică aritmetica shift right (arithmetic)
th: เลื่อนบิต ขวา เลขคณิต shift right (arithmetic)
tr: sağa kaydır aritmetik shift right (arithmetic)
uk: зсув праворуч арифметичний shift right (arithmetic)
vi: dịch bit phải số học shift right (arithmetic)
zh_hans: 右移 算术 移位 shift right (arithmetic)
zh_hant: 右移 算術 shift right (arithmetic)

# DataOp_Kind_RotateLeft
source: Rotate left
ar: تدوير لليسار
cs: Rotace doleva
de: Nach links rotieren
el: Περιστροφή αριστερά
es: Rotar a la izquierda
fa: چرخش به چپ
fr: Rotation à gauche
hu: Forgatás balra
id: Rotasi kiri
it: Rotazione a sinistra
ja: 左ローテート
ko: 왼쪽 회전
pl: Obróć w lewo
pt: Rotacionar para a esquerda
ro: Rotire la stânga
th: หมุนซ้าย
tr: Sola döndür
uk: Циклічний зсув ліворуч
vi: Xoay trái
zh_hans: 循环左移
zh_hant: 向左旋轉

# Cmd_data_op_rotateLeft
source: Rotate left
ar: تدوير لليسار
cs: Rotace doleva
de: Nach links rotieren
el: Περιστροφή αριστερά
es: Rotar a la izquierda
fa: چرخش به چپ
fr: Rotation à gauche
hu: Forgatás balra
id: Rotasi kiri
it: Rotazione a sinistra
ja: 左ローテート
ko: 왼쪽 회전
pl: Obróć w lewo
pt: Rotacionar para a esquerda
ro: Rotire la stânga
th: หมุนซ้าย
tr: Sola döndür
uk: Циклічний зсув ліворуч
vi: Xoay trái
zh_hans: 循环左移
zh_hant: 向左旋轉

# CmdAlias_data_op_rotateLeft
source: rotate left
ar: rotate left تدوير لليسار
cs: rotace otočit otocit doleva rotate left
de: links rotieren rotate left
el: περιστροφή αριστερά rotate left
es: rotar izquierda rotate left
fa: چرخش به چپ, rotate left
fr: rotation gauche rotate left
hu: forgatás forgatas rotálás rotalas balra rotate left
id: rotasi putar bit kiri rotate left
it: rotazione sinistra rotate left
ja: ひだりろーてーと かいてん
ko: 왼쪽 회전 로테이트 좌 rotate left
pl: rotacja w lewo obróć rotate left
pt: rotacionar esquerda rotate left
ro: rotire rotație rotatie stânga stanga rotate left
th: หมุนบิต ซ้าย rotate left
tr: sola döndür rotate left
uk: циклічний зсув ліворуч rotate left
vi: xoay bit trái rotate left
zh_hans: 循环左移 旋转 rotate left
zh_hant: 向左旋轉 循環左移 rotate left

# DataOp_Kind_RotateRight
source: Rotate right
ar: تدوير لليمين
cs: Rotace doprava
de: Nach rechts rotieren
el: Περιστροφή δεξιά
es: Rotar a la derecha
fa: چرخش به راست
fr: Rotation à droite
hu: Forgatás jobbra
id: Rotasi kanan
it: Rotazione a destra
ja: 右ローテート
ko: 오른쪽 회전
pl: Obróć w prawo
pt: Rotacionar para a direita
ro: Rotire la dreapta
th: หมุนขวา
tr: Sağa döndür
uk: Циклічний зсув праворуч
vi: Xoay phải
zh_hans: 循环右移
zh_hant: 向右旋轉

# Cmd_data_op_rotateRight
source: Rotate right
ar: تدوير لليمين
cs: Rotace doprava
de: Nach rechts rotieren
el: Περιστροφή δεξιά
es: Rotar a la derecha
fa: چرخش به راست
fr: Rotation à droite
hu: Forgatás jobbra
id: Rotasi kanan
it: Rotazione a destra
ja: 右ローテート
ko: 오른쪽 회전
pl: Obróć w prawo
pt: Rotacionar para a direita
ro: Rotire la dreapta
th: หมุนขวา
tr: Sağa döndür
uk: Циклічний зсув праворуч
vi: Xoay phải
zh_hans: 循环右移
zh_hant: 向右旋轉

# CmdAlias_data_op_rotateRight
source: rotate right
ar: rotate right تدوير لليمين
cs: rotace otočit otocit doprava rotate right
de: rechts rotieren rotate right
el: περιστροφή δεξιά rotate right
es: rotar derecha rotate right
fa: چرخش به راست, rotate right
fr: rotation droite rotate right
hu: forgatás forgatas rotálás rotalas jobbra rotate right
id: rotasi putar bit kanan rotate right
it: rotazione destra rotate right
ja: みぎろーてーと かいてん
ko: 오른쪽 회전 로테이트 우 rotate right
pl: rotacja w prawo obróć rotate right
pt: rotacionar direita rotate right
ro: rotire rotație rotatie dreapta rotate right
th: หมุนบิต ขวา rotate right
tr: sağa döndür rotate right
uk: циклічний зсув праворуч rotate right
vi: xoay bit phải rotate right
zh_hans: 循环右移 旋转 rotate right
zh_hant: 向右旋轉 循環右移 rotate right

# DataOp_Kind_ByteSwap16
source: Byte swap (16 bit)
ar: تبديل البايتات (16 بت)
cs: Prohození bajtů (16 bitů)
de: Bytes tauschen (16 Bit)
el: Αντιμετάθεση byte (16 bit)
es: Intercambiar bytes (16 bits)
fa: جابه‌جایی بایت‌ها (16 بیتی)
fr: Permutation d'octets (16 bits)
hu: Bájtcsere (16 bit)
id: Tukar byte (16-bit)
it: Scambia byte (16 bit)
ja: バイトスワップ (16 bit)
ko: 바이트 스왑(16비트)
pl: Zamień bajty (16 bitów)
pt: Trocar bytes (16 bits)
ro: Inversare octeți (16 biți)
th: สลับไบต์ (16 บิต)
tr: Bayt takası (16 bit)
uk: Перестановка байтів (16 біт)
vi: Hoán đổi byte (16 bit)
zh_hans: 字节交换（16 位）
zh_hant: 位元組交換（16 位元）

# Cmd_data_op_byteSwap16
source: Byte swap (16 bit)
ar: تبديل البايتات (16 بت)
cs: Prohození bajtů (16 bitů)
de: Bytes tauschen (16 Bit)
el: Αντιμετάθεση byte (16 bit)
es: Intercambiar bytes (16 bits)
fa: جابه‌جایی بایت‌ها (16 بیتی)
fr: Permutation d'octets (16 bits)
hu: Bájtcsere (16 bit)
id: Tukar byte (16-bit)
it: Scambia byte (16 bit)
ja: バイトスワップ (16 bit)
ko: 바이트 스왑(16비트)
pl: Zamień bajty (16 bitów)
pt: Trocar bytes (16 bits)
ro: Inversare octeți (16 biți)
th: สลับไบต์ (16 บิต)
tr: Bayt takası (16 bit)
uk: Перестановка байтів (16 біт)
vi: Hoán đổi byte (16 bit)
zh_hans: 字节交换（16 位）
zh_hant: 位元組交換（16 位元）

# CmdAlias_data_op_byteSwap16
source: byte swap (16 bit)
ar: byte swap (16 bit) تبديل البايتات ترتيب
cs: prohodit prohození prohozeni bajty pořadí poradi bajtů bajtu byte swap (16 bit)
de: bytes tauschen bytereihenfolge byte swap (16 bit)
el: αντιμετάθεση σειρά byte byte swap (16 bit)
es: intercambiar bytes orden de bytes byte swap (16 bit)
fa: جابه‌جایی بایت ترتیب بایت, byte swap (16 bit)
fr: permuter octets boutisme byte swap (16 bit)
hu: bájtcsere bajtcsere bájtsorrend bajtsorrend endian byte swap (16 bit)
id: tukar byte urutan byte byte swap (16 bit)
it: scambia byte ordine dei byte endian byte swap (16 bit)
ja: ばいとすわっぷ えんでぃあん
ko: 바이트 스왑 교환 엔디언 byte swap (16 bit)
pl: zamień bajty kolejność bajtów endian byte swap (16 bit)
pt: trocar bytes ordem dos bytes endian byte swap (16 bit)
ro: inversare interschimbare octeți octeti ordinea octeților endian byte swap (16 bit)
th: สลับไบต์ ลำดับไบต์ byte swap (16 bit)
tr: bayt takası byte swap (16 bit)
uk: перестановка байтів byte swap (16 bit)
vi: hoán đổi byte thứ tự byte byte swap (16 bit)
zh_hans: 字节交换 字节序 byte swap (16 bit)
zh_hant: 位元組交換 位元組順序 byte swap (16 bit)

# DataOp_Kind_ByteSwap32
source: Byte swap (32 bit)
ar: تبديل البايتات (32 بت)
cs: Prohození bajtů (32 bitů)
de: Bytes tauschen (32 Bit)
el: Αντιμετάθεση byte (32 bit)
es: Intercambiar bytes (32 bits)
fa: جابه‌جایی بایت‌ها (32 بیتی)
fr: Permutation d'octets (32 bits)
hu: Bájtcsere (32 bit)
id: Tukar byte (32-bit)
it: Scambia byte (32 bit)
ja: バイトスワップ (32 bit)
ko: 바이트 스왑(32비트)
pl: Zamień bajty (32 bity)
pt: Trocar bytes (32 bits)
ro: Inversare octeți (32 de biți)
th: สลับไบต์ (32 บิต)
tr: Bayt takası (32 bit)
uk: Перестановка байтів (32 біти)
vi: Hoán đổi byte (32 bit)
zh_hans: 字节交换（32 位）
zh_hant: 位元組交換（32 位元）

# Cmd_data_op_byteSwap32
source: Byte swap (32 bit)
ar: تبديل البايتات (32 بت)
cs: Prohození bajtů (32 bitů)
de: Bytes tauschen (32 Bit)
el: Αντιμετάθεση byte (32 bit)
es: Intercambiar bytes (32 bits)
fa: جابه‌جایی بایت‌ها (32 بیتی)
fr: Permutation d'octets (32 bits)
hu: Bájtcsere (32 bit)
id: Tukar byte (32-bit)
it: Scambia byte (32 bit)
ja: バイトスワップ (32 bit)
ko: 바이트 스왑(32비트)
pl: Zamień bajty (32 bity)
pt: Trocar bytes (32 bits)
ro: Inversare octeți (32 de biți)
th: สลับไบต์ (32 บิต)
tr: Bayt takası (32 bit)
uk: Перестановка байтів (32 біти)
vi: Hoán đổi byte (32 bit)
zh_hans: 字节交换（32 位）
zh_hant: 位元組交換（32 位元）

# CmdAlias_data_op_byteSwap32
source: byte swap (32 bit)
ar: byte swap (32 bit) تبديل البايتات ترتيب
cs: prohodit prohození prohozeni bajty pořadí poradi bajtů bajtu byte swap (32 bit)
de: bytes tauschen bytereihenfolge byte swap (32 bit)
el: αντιμετάθεση σειρά byte byte swap (32 bit)
es: intercambiar bytes orden de bytes byte swap (32 bit)
fa: جابه‌جایی بایت ترتیب بایت, byte swap (32 bit)
fr: permuter octets boutisme byte swap (32 bit)
hu: bájtcsere bajtcsere bájtsorrend bajtsorrend endian byte swap (32 bit)
id: tukar byte urutan byte byte swap (32 bit)
it: scambia byte ordine dei byte endian byte swap (32 bit)
ja: ばいとすわっぷ えんでぃあん
ko: 바이트 스왑 교환 엔디언 byte swap (32 bit)
pl: zamień bajty kolejność bajtów endian byte swap (32 bit)
pt: trocar bytes ordem dos bytes endian byte swap (32 bit)
ro: inversare interschimbare octeți octeti ordinea octeților endian byte swap (32 bit)
th: สลับไบต์ ลำดับไบต์ byte swap (32 bit)
tr: bayt takası byte swap (32 bit)
uk: перестановка байтів byte swap (32 bit)
vi: hoán đổi byte thứ tự byte byte swap (32 bit)
zh_hans: 字节交换 字节序 byte swap (32 bit)
zh_hant: 位元組交換 位元組順序 byte swap (32 bit)

# DataOp_Kind_ByteSwap64
source: Byte swap (64 bit)
ar: تبديل البايتات (64 بت)
cs: Prohození bajtů (64 bitů)
de: Bytes tauschen (64 Bit)
el: Αντιμετάθεση byte (64 bit)
es: Intercambiar bytes (64 bits)
fa: جابه‌جایی بایت‌ها (64 بیتی)
fr: Permutation d'octets (64 bits)
hu: Bájtcsere (64 bit)
id: Tukar byte (64-bit)
it: Scambia byte (64 bit)
ja: バイトスワップ (64 bit)
ko: 바이트 스왑(64비트)
pl: Zamień bajty (64 bity)
pt: Trocar bytes (64 bits)
ro: Inversare octeți (64 de biți)
th: สลับไบต์ (64 บิต)
tr: Bayt takası (64 bit)
uk: Перестановка байтів (64 біти)
vi: Hoán đổi byte (64 bit)
zh_hans: 字节交换（64 位）
zh_hant: 位元組交換（64 位元）

# Cmd_data_op_byteSwap64
source: Byte swap (64 bit)
ar: تبديل البايتات (64 بت)
cs: Prohození bajtů (64 bitů)
de: Bytes tauschen (64 Bit)
el: Αντιμετάθεση byte (64 bit)
es: Intercambiar bytes (64 bits)
fa: جابه‌جایی بایت‌ها (64 بیتی)
fr: Permutation d'octets (64 bits)
hu: Bájtcsere (64 bit)
id: Tukar byte (64-bit)
it: Scambia byte (64 bit)
ja: バイトスワップ (64 bit)
ko: 바이트 스왑(64비트)
pl: Zamień bajty (64 bity)
pt: Trocar bytes (64 bits)
ro: Inversare octeți (64 de biți)
th: สลับไบต์ (64 บิต)
tr: Bayt takası (64 bit)
uk: Перестановка байтів (64 біти)
vi: Hoán đổi byte (64 bit)
zh_hans: 字节交换（64 位）
zh_hant: 位元組交換（64 位元）

# CmdAlias_data_op_byteSwap64
source: byte swap (64 bit)
ar: byte swap (64 bit) تبديل البايتات ترتيب
cs: prohodit prohození prohozeni bajty pořadí poradi bajtů bajtu byte swap (64 bit)
de: bytes tauschen bytereihenfolge byte swap (64 bit)
el: αντιμετάθεση σειρά byte byte swap (64 bit)
es: intercambiar bytes orden de bytes byte swap (64 bit)
fa: جابه‌جایی بایت ترتیب بایت, byte swap (64 bit)
fr: permuter octets boutisme byte swap (64 bit)
hu: bájtcsere bajtcsere bájtsorrend bajtsorrend endian byte swap (64 bit)
id: tukar byte urutan byte byte swap (64 bit)
it: scambia byte ordine dei byte endian byte swap (64 bit)
ja: ばいとすわっぷ えんでぃあん
ko: 바이트 스왑 교환 엔디언 byte swap (64 bit)
pl: zamień bajty kolejność bajtów endian byte swap (64 bit)
pt: trocar bytes ordem dos bytes endian byte swap (64 bit)
ro: inversare interschimbare octeți octeti ordinea octeților endian byte swap (64 bit)
th: สลับไบต์ ลำดับไบต์ byte swap (64 bit)
tr: bayt takası byte swap (64 bit)
uk: перестановка байтів byte swap (64 bit)
vi: hoán đổi byte thứ tự byte byte swap (64 bit)
zh_hans: 字节交换 字节序 byte swap (64 bit)
zh_hant: 位元組交換 位元組順序 byte swap (64 bit)
